## Pandas: ficheros

In [18]:
import pandas as pd
import numpy as np

In [2]:
path = "../practicas/pandas/merge/Pedidos.txt"

In [3]:
dtPedidos = pd.read_csv(path, sep=';')
dtPedidos.head(6)

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica
5     10253   HANAR           3          2    58.17     Brasil

In [4]:
dtPedidos.shape

(830, 6)

In [5]:
dtPedidos.tail()

     idpedido cliente  idempleado  idempresa  importe            pais
825     11073   PERIC           2          2    24.95          Mexico
826     11074   SIMOB           7          2    18.44       Dinamarca
827     11075   RICSU           8          2     6.19           Suiza
828     11076   BONAP           4          2    38.28         Francia
829     11077   RATTC           1          2     8.53  Estados Unidos

In [6]:
dtPedidos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   idpedido    830 non-null    int64
 1   cliente     830 non-null    object
 2   idempleado  830 non-null    int64
 3   idempresa   830 non-null    int64
 4   importe     830 non-null    float64
 5   pais        830 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 39.0+ KB

In [7]:
dtPedidos.describe()

           idpedido  idempleado   idempresa      importe
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.008434    78.244205
std      239.744656    2.499648    0.778899   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

In [8]:
dtPedidos.columns

Index(['idpedido', 'cliente', 'idempleado', 'idempresa', 'importe', 'pais'], dtype='object')

In [10]:
#dtPedidos['pais']
L = list(dtPedidos.pais.unique())
L

['Finlandia',
 'Alemania',
 'Brasil',
 'Francia',
 'Belgica',
 'Suiza',
 'Venezuela',
 'Austria',
 'Mexico',
 'Estados Unidos',
 'Suecia',
 'Italia',
 'Espanya',
 'Reino Unido',
 'Irlanda',
 'Portugal',
 'Canada',
 'Dinamarca',
 'Polonia',
 'Noruega',
 'Argentina']

In [13]:
dtPedidos.pais.value_counts()

Estados Unidos    123
Alemania          122
Brasil             83
Francia            76
Reino Unido        55
Venezuela          46
Austria            40
Suecia             38
Canada             30
Mexico             28
Italia             28
Espanya            23
Finlandia          23
Irlanda            19
Belgica            19
Suiza              18
Dinamarca          18
Argentina          16
Portugal           13
Polonia             6
Noruega             6
Name: pais, dtype: int64

In [14]:
# Sumar el importe de los pedidos de Polonia
dtPedidos[dtPedidos.pais == 'Polonia'].importe.sum()

163.7

In [15]:
# Pedidos de Polonia
dtPedidos[dtPedidos.pais == 'Polonia']

     idpedido cliente  idempleado  idempresa  importe     pais
126     10374   WOLZA           1          3     3.94  Polonia
363     10611   WOLZA           6          2    80.65  Polonia
544     10792   WOLZA           1          3    23.79  Polonia
658     10906   WOLZA           4          3    26.29  Polonia
750     10998   WOLZA           8          2    20.31  Polonia
796     11044   WOLZA           4          1     8.72  Polonia

In [16]:
dtPedidos[dtPedidos.pais == 'Polonia'].importe

126     3.94
363    80.65
544    23.79
658    26.29
750    20.31
796     8.72
Name: importe, dtype: float64

In [19]:
np.sum(dtPedidos[dtPedidos.pais == 'Polonia'].importe)

163.7

In [20]:
# Pedidos de Polonia y la empresa 3
dtPedidos[(dtPedidos.pais == 'Polonia') & \
          (dtPedidos.idempresa == 3)]

     idpedido cliente  idempleado  idempresa  importe     pais
126     10374   WOLZA           1          3     3.94  Polonia
544     10792   WOLZA           1          3    23.79  Polonia
658     10906   WOLZA           4          3    26.29  Polonia

Nuevas columnas

In [21]:
dtPedidos['porc_iva']=0.21

In [22]:
dtPedidos.head(3)

   idpedido cliente  idempleado  idempresa  importe       pais  porc_iva
0     10248   WILMK           5          3    32.38  Finlandia      0.21
1     10249   TOMSP           6          1    11.61   Alemania      0.21
2     10250   HANAR           4          2    65.83     Brasil      0.21

In [25]:
dtPedidos['iva'] = \
round(dtPedidos.porc_iva  * dtPedidos.importe,2)
dtPedidos['total'] = \
round(dtPedidos.iva  + dtPedidos.importe,2)
dtPed = dtPedidos[['idpedido','cliente','importe',\
                  'iva','total','pais']]
dtPed.head(2)

   idpedido cliente  importe   iva  total       pais
0     10248   WILMK    32.38  6.80  39.18  Finlandia
1     10249   TOMSP    11.61  2.44  14.05   Alemania

#### Repatir los pedidos en varios ficheros. Un fichero para cada pais

In [ ]:
paises = dtPed.pais.unique()
for p in paises:
    # Aplicar un filtro
    
    # Generar nombre de fichero
    
    # Exportar al fichero

In [29]:
dtPedidos.to_csv('pedidos.csv',\
                 sep=';',index=False,float_format="%.2f")

In [34]:
dtPedidos.to_excel('pedidos.xlsx',\
                 index=False,float_format="%.2f")

In [30]:
dtPedidos.to_html('pedidos.html',\
                 index=False,float_format="%.2f")